# プライバシーポリシー

m-engは、「地デジアンテナ調整アプリ」（以下、「本サービス」）を広告を含む形式で提供しています。本サービスは無償で提供され、そのままの状態でご利用いただくことを目的としています。

このページは、本サービスを利用することを選択された場合に、個人情報の収集、利用、開示に関する方針を訪問者に通知するために使用されます。

本サービスを利用する場合、この方針に従って情報の収集と利用に同意するものとします。私が収集する個人情報は、本サービスの提供と改善に利用されます。私は、このプライバシーポリシーで説明されている以外の目的で情報を利用したり、第三者と共有したりすることはありません。

このプライバシーポリシーで使用されている用語は、特に定義されていない限り、「地デジアンテナ調整」の利用規約において使用されているものと同じ意味を持ちます。

## 情報の収集と利用

より良い体験のために、本サービスを利用する際に特定の個人情報を提供することがあります。リクエストされる情報は、あなたのデバイスに保持され、私自身によって一切収集されません。

本アプリは、あなたを識別するために使用される情報を収集する可能性がある第三者のサービスを使用しています。

アプリが使用するサードパーティサービスプロバイダーのプライバシーポリシーへのリンク

- [Google Play サービス](https://www.google.com/policies/privacy/)
- [AdMob](https://support.google.com/admob/answer/6128543?hl=en)
- [Google Analytics for Firebase](https://firebase.google.com/support/privacy)
- [Firebase Crashlytics](https://firebase.google.com/support/privacy/)

## ログデータ

本サービスを使用する際、アプリ内でエラーが発生した場合には、サードパーティ製品を通じてあなたの電話からデータと情報（ログデータと呼ばれる）を収集します。このログデータには、デバイスのインターネットプロトコル（IP）アドレス、デバイス名、オペレーティングシステムのバージョン、私のサービスを利用する際のアプリの設定、サービスの使用時刻と日付、その他の統計情報が含まれる可能性があります。

## クッキー

クッキーは、一般に匿名の一意の識別子として使用される少量のデータファイルです。これらは、訪れたウェブサイトからあなたのブラウザに送信され、デバイスの内部メモリに保存されます。

本サービスは、明示的にこれらの「クッキー」を使用しません。ただし、アプリはサードパーティのコードやライブラリを使用して「クッキー」を使用し、情報を収集しサービスを改善する可能性があります。クッキーの受け入れまたは拒否を選択するオプションがあり、クッキーがデバイスに送信される際に通知を受けることができます。クッキーを拒否することを選択した場合、本サービスの一部を使用できない可能性があります。

## サービスプロバイダー

次の理由で、第三者の企業や個人を雇用する場合があります。

- サービスを効率的に提供するため
- 私たちの代わりにサービスを提供するため
- サービスに関連するサービスを実行するため
- 私たちのサービスの使用方法を分析するために私たちを支援するため

本サービスの利用者にお知らせしますが、これらの第三者は彼らに割り当てられたタスクを代わりに実行するために個人情報へのアクセス権を持っています。ただし、情報を開示または他の目的で使用することは禁止されています。

## セキュリティ

あなたの個人情報を提供いただく信頼を大切にしています。そのため、商業的に受け入れられる方法で保護するために努力しています。ただし、インターネットを介した転送方法や電子ストレージ方法は100％安全で信頼性があるわけではなく、その絶対的なセキュリティを保証することはできません。

## 他のサイトへのリンク

本サービスには他のサイトへのリンクが含まれている場合があります。サードパーティのリンクをクリックすると、そのサイトに移動します。これらの外部サイトは私によって運営されていないため、これらのウェブサイトのプライバシーポリシーを注意深く確認することをお勧めします。私はこれらのサードパーティサイトやサービスの内容、プライバシーポリシー、慣行に関して制御権を持っておらず、一切の責任を負いません。

## 児童のプライバシー

このサービスは13歳未満の個人情報を対象としていません。私は意図的に13歳未満の子供から個人情報を収集することはありません。13歳未満の子供が個人情報を提供したことが判明した場合、私は直ちにそれをサーバーから削除します。もし親または保護者であり、ご自身の子供が私に個人情報を提供したことを知っている場合は、適切な措置を講じるために私に連絡していただけますようお願い申し上げます。

## このプライバシーポリシーの変更

私は定期的にプライバシーポリシーを更新する場合があります。したがって、変更があるかどうかを確認するためにこのページを定期的に確認することをお勧めします。新しいプライバシーポリシーをこのページに掲載することで、変更を通知します。

この方針は2026年6月12日から有効です。

## お問い合わせ

プライバシーポリシーに関するご質問や提案がある場合は、どうぞお気軽に dev@m-eng.jp までご連絡ください。
